Tekla Open API Reference for Tekla Structures 2025
EnvironmentFiles.IsValidDirectory Method
 Checks if a directory is valid.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool IsValidDirectory(
	string directory
)
Public Shared Function IsValidDirectory (
	directory As String
) As Boolean
Parameters
directory
Type: System.String
The directory to be checked.
Return Value
Type: Boolean
True if the directory is valid.
See Also
Reference
EnvironmentFiles Class
Tekla.Structures.Dialog.UIControls Namespace